// 颜色对应表
export const ColorObj = {
  10: "orange",
  30: "purple",
  50: "green",
  60: "red",
};

export const StudentStatusObj = {
  HAS_COMMIT: 10,
  INTERVIEWING: 30,
  ACCESS: 50,
  REJECT: 60,
};

// 部门对应表
export const DepInfoArr = [
  { name: "总览表", id: 0 },
  {
    name: "维修部",
    id: 1,
  },
  {
    name: "秘书部",
    id: 2,
  },
  {
    name: "项目部",
    id: 3,
  },
  {
    name: "网宣部",
    id: 4,
  },
  {
    name: "外联部",
    id: 5,
  },
  {
    name: "实践部",
    id: 6,
  },
  {
    name: "软件组",
    id: 7,
  },
];

// 部门选择对应表
export const KeyToLeftListName = {
  0: "总览表",
  1: "维修部",
  2: "秘书部",
  3: "项目部",
  4: "网宣部",
  5: "外联部",
  6: "实践部",
  7: "软件组",
};

export const KeyToDepName = {
  1: "维修部",
  2: "秘书部",
  3: "项目部",
  4: "网宣部",
  5: "外联部",
  6: "实践部",
  7: "软件组",
};

export const CollegeObj = {
  0: "机电工程学院",
  1: "自动化学院",
  2: "轻工化工学院",
  3: "信息工程学院",
  4: "土木与交通工程学院",
  5: "管理学院",
  6: "计算机学院",
  7: "材料与能源学院",
  8: "环境科学与工程学院",
  9: "外国语学院",
  10: "数学与统计学院",
  11: "物理与光电工程学院",
  12: "艺术与设计学院",
  13: "法学院",
  14: "建筑与城市规划学院",
  15: "经济学院",
  16: "马克思主义学院",
  17: "国际交流学院",
  18: "生物医药学院",
  19: "先进制造学院",
  20: "生态环境与资源学院",
  21: "集成电路学院",
  22: "商学院",
  23: "国际教育学院",
  24: "体育学院",
  25: "实验教学部",
  26: "继续教育学院",
  27: "创新创业学院",
};
